from __future__ import annotations

from datetime import datetime

from pydantic import BaseModel, ConfigDict


class MetalModel(BaseModel):
    """
    Универсальная модель свечи металла MOEX.

    Используется:

    - дневные свечи D1
    - минутные свечи M1
    - другие таймфреймы MOEX

    Время:
        Europe/Moscow
    """


    model_config = ConfigDict(
        extra="ignore"
    )


    # --------------------------------------------------
    # Инструмент MOEX
    # --------------------------------------------------

    ticker: str = ""

    name: str = ""



    # --------------------------------------------------
    # Информация площадки
    # --------------------------------------------------

    engine: str = ""

    market: str = ""

    board: str = ""



    # --------------------------------------------------
    # Время свечи
    # --------------------------------------------------

    date: datetime | str | None = None



    # --------------------------------------------------
    # OHLC
    # --------------------------------------------------

    open: float = 0.0

    high: float = 0.0

    low: float = 0.0

    close: float = 0.0



    # --------------------------------------------------
    # Объемы
    # --------------------------------------------------

    volume: int = 0

    value: float = 0.0