from maxapi.context import State, StatesGroup



class UserStates(StatesGroup):


    # =====================================
    # КОТИРОВКА
    # =====================================


    # пользователь вводит тикер
    WAIT_TICKER = State()


    # меню выбранной акции
    QUOTE_MENU = State()



    # =====================================
    # АНАЛИЗ ТИКЕТА
    # =====================================


    # пользователь вводит тикер для анализа
    WAIT_ANALYSIS_TICKER = State()


    # выбор периода анализа тикета
    WAIT_ANALYSIS_TICKER_PERIOD = State()



    # =====================================
    # АНАЛИЗ АКЦИЙ
    # =====================================


    # выбор периода анализа акций
    WAIT_ANALYSIS_STOCKS_PERIOD = State()



    # =====================================
    # АНАЛИЗ СЕКТОРОВ
    # =====================================


    # выбор периода анализа секторов
    WAIT_ANALYSIS_SECTORS_PERIOD = State()



    # =====================================
    # ПОРТФЕЛЬ
    # =====================================


    # ввод тикера
    WAIT_PORTFOLIO_TICKER = State()


    # ввод количества
    WAIT_PORTFOLIO_QUANTITY = State()


    # ввод цены покупки
    WAIT_PORTFOLIO_PRICE = State()



    # удаление позиции
    WAIT_DELETE_TICKER = State()



    # =====================================
    # УВЕДОМЛЕНИЯ
    # =====================================


    # создание уведомления из общего меню
    # пользователь вводит тикер
    WAIT_ALERT_TICKER = State()



    # создание уведомления из выбранной котировки
    # тикер уже есть в context
    # пользователь вводит цену
    WAIT_ALERT_PRICE = State()



    # выбор условия уведомления
    WAIT_ALERT_CONDITION = State()



    # =====================================
    # ПРОДАЖА
    # =====================================


    WAIT_SELL_TICKER = State()


    WAIT_SELL_QUANTITY = State()


    WAIT_SELL_PRICE = State()