from __future__ import annotations

from pydantic import BaseModel, ConfigDict


class SecurityModel(BaseModel):
    """
    Модель инструмента MOEX ISS.

    Используется:

    - каталог инструментов
    - поиск SECID
    - получение свечей
    - акции
    - металлы
    - валюты
    """



    model_config = ConfigDict(
        extra="ignore"
    )



    # --------------------------------------------------
    # Идентификаторы
    # --------------------------------------------------

    secid: str = ""


    isin: str = ""



    # --------------------------------------------------
    # Названия
    # --------------------------------------------------

    shortname: str = ""

    name: str = ""

    secname: str = ""



    # --------------------------------------------------
    # Торговая инфраструктура
    # --------------------------------------------------

    engine: str = ""

    market: str = ""

    board: str = ""

    board_title: str = ""



    # --------------------------------------------------
    # Валюта
    # --------------------------------------------------

    currency: str = ""

    currency_id: str = ""



    # --------------------------------------------------
    # Параметры инструмента
    # --------------------------------------------------

    decimals: int = 0

    lotsize: int = 0



    # --------------------------------------------------
    # Статусы
    # --------------------------------------------------

    trading_status: str = ""

    active: bool = True



    # --------------------------------------------------
    # Дополнительная информация MOEX
    # --------------------------------------------------

    primary_boardid: str = ""

    listed_from: str = ""

    listed_till: str = ""